In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("student.csv")

In [4]:
df

    roll     name class  marks   age
0      1     anil    TE   56.0  21.0
1      2     amit    TE   65.0  21.0
2      3   aniket    BE   64.0  22.0
3      4  ajinkya    BE   98.0  22.0
4      5     asha    SE   62.0  20.0
5      6   ayesha    SE   58.0  20.0
6      7     amar    SE   78.0   NaN
7      8    amita    TE    NaN  21.0
8      9     amol    TE   70.0  21.0
9     10    anmol    BE   88.0  22.0
10    11    resha    BE   85.0  22.0
11    12     ekta    BE   80.0  23.0
12    13   nikita    TE   78.0  21.0
13    14   amruta    TE    NaN  20.0
14    15   mugdha    TE   75.0  20.0

In [5]:
df.mean()

C:\Users\ailab pc-1\AppData\Local\Temp\ipykernel_2208\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

roll      8.000000
marks    73.615385
age      21.142857
dtype: float64

In [6]:
df.median()

C:\Users\ailab pc-1\AppData\Local\Temp\ipykernel_2208\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

roll      8.0
marks    75.0
age      21.0
dtype: float64

In [7]:
df.std()

C:\Users\ailab pc-1\AppData\Local\Temp\ipykernel_2208\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

roll      4.472136
marks    12.520240
age       0.949262
dtype: float64

In [8]:
df.min()

roll           1
name     ajinkya
class         BE
marks       56.0
age         20.0
dtype: object

In [9]:
df.max()

roll        15
name     resha
class       TE
marks     98.0
age       23.0
dtype: object

In [10]:
import numpy as np

In [11]:
np.std(df['marks'])

12.029057521355153

In [12]:
gr1 = df.groupby('class')

In [13]:
gr1.groups

{'BE': [2, 3, 9, 10, 11], 'SE': [4, 5, 6], 'TE': [0, 1, 7, 8, 12, 13, 14]}

In [14]:
te = gr1.get_group('TE')

In [15]:
te.min()

roll        1
name     amit
class      TE
marks    56.0
age      20.0
dtype: object

In [16]:
te.max()

roll         15
name     nikita
class        TE
marks      78.0
age        21.0
dtype: object

In [17]:
gr2 = df.groupby('age')

In [18]:
gr2.groups

{20.0: [4, 5, 13, 14], 21.0: [0, 1, 7, 8, 12], 22.0: [2, 3, 9, 10], 23.0: [11]}

In [19]:
tw = gr2.get_group(20)

In [20]:
tw

    roll    name class  marks   age
4      5    asha    SE   62.0  20.0
5      6  ayesha    SE   58.0  20.0
13    14  amruta    TE    NaN  20.0
14    15  mugdha    TE   75.0  20.0

In [21]:
import seaborn as sns

In [22]:
data = pd.read_csv('IRIS.csv')

In [23]:
data

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [24]:
gr = data.groupby('species')

In [30]:
gr.groups

{'Iris-setosa': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], 'Iris-versicolor': [50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], 'Iris-virginica': [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]}

In [25]:
se = gr.get_group('Iris-setosa')
ve = gr.get_group('Iris-versicolor')
vi = gr.get_group('Iris-virginica')

In [26]:
se.shape

(50, 5)

In [27]:
ve.shape

(50, 5)

In [28]:
vi.shape

(50, 5)

In [29]:
se.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

In [31]:
ve.describe()

       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [32]:
vi.describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000